# Начните с альпийского изображения, которое меньше, но без причудливых инструментов.
FROM alpine:3.13

#Используйте /usr/src/app в качестве рабочего каталога. В этом месте будут выполняться следующие инструкции.
WORKDIR /usr/src/app
# Скопируйте файл hello.sh из этого места в /usr/src/app/, создав /usr/src/app/hello.sh
COPY hello.sh .

# В качестве альтернативы, если мы пропустили chmod ранее, мы можем добавить разрешения на выполнение во время сборки. 
RUN chmod +x hello.sh
RUN touch additional.txt
# При запуске docker run команда будет ./hello.sh
CMD . hello.sh